# EXMPL.
# y = input('What\'s you name?')
#
# def function_name(x):
#     return (f"Hello {x}")
# print(function_name(y))

# 2.
# name = input('What\'s you name?:  ')
# order = input('You number: ')
#
#
# def text_name(x, y):
#     print(f'Hello {x}, you order is {y}')
#
#
# text_name(name, order)

# 3.
""". Создать произвольный список
2. Добавить новый элемент типа str в конец списка
3. Добавить новый элемент типа int на место с индексом
4. Добавить новый элемент типа list в конец списка
5. Добавить новый элемент типа tuple на место с индексом
6. Получить элемент по индексу
7. Удалить элемент
8. Найти число повторений элемента списка
9. Получите первый и последний элемент списка
10.Проверить, есть ли в последовательности дубликат
"""
# lis = [2, 3, 'Hi!', 'Name', '34', ' ', 234, 'Katya']

# lis.append('Love')
# print(lis)
#
# lis[0:2] = ['Ommg', 'Kat']
# print(lis)
#
# lis.insert(8, 7)
# print(lis)
#
# lis.insert(7, 'Like')
# print(lis)
#
# lis.pop(9)
# print(lis)
#
# print(lis[0])
#
# lis[5] ='By!'
# print(lis)
#
# print(lis[-3])
#
# lis.extend('5k')
# print(lis)
#
# lis.remove('k')
# print(lis)
#
# print(len(lis))
#
# print(lis[3:9])
#
# lis.pop(4)
# print(lis)

# del lis[5:7]
# print(lis)

# lis.insert(-1, ['Moon'])
# print(lis)

# lis.clear()
# print(lis)

# lis.reverse()
# print(lis)




# my_list = [1, "a", 2.3, True]
# print(my_list[2])
# my_list.append("Hi")
# print(my_list)
# my_list.pop(1)
# print(my_list)
# my_list.insert(0, 8)
# print(my_list)
# my_list.insert(2, 'By')
# print(my_list)
# my_list.append([3])
# print(my_list)
# my_list.insert(0, [6, 'tea'])
# print(my_list)
# my_list.insert(-1, ('book','magazin'))
# print(my_list)
# print(my_list[-1])
#
# my_tuple = (1, "f", 4.6, False, 1, 'f')
# my_tuple = set(my_tuple)
# print(my_tuple)

# my_tuple2 = ('Book', 'Author', 'date', 'publisher')
# my_shop = ['apple', 5, '$', False, 'discount']
#
# Dictionary

# 1. Создать произвольный словарь
# my_dict = {
#     'key': 'value',
#     'bookName': 'Tom Soyer',
#     'Author': 'Twen',
#     'Date': 2022,
#     'is new': True,
#     1: 'yes'
# }
# 2. Добавить новый элемент с ключом типа str и значением типа int
# my_dict['newbook'] = 'Kolobok'
# print(my_dict)
# 3. Добавить новый элемент с ключом типа кортеж(tuple) и значением типа список(list)
# my_dict[('newkey', 'hh')] = [4, 3, 'kolo', True, [1, 1, 1, 1]]
# print(my_dict)
# 4. Получить элемент по ключу
# print(my_dict['Author'])
# 5. Удалить элемент по ключу
# my_dict.pop(('newkey', 'hh'))
# print(my_dict)
# 6. Получить список ключей словаря
# print(my_dict.keys())

# my_dict = {
#     'key': 'value',
#     'bookName': 'Tom Soyer',
#     'Author': 'Twen',
#     'Date': 2022,
#     'is new': True,
#     1: 'yes'
# }
# my_dict['Date'] = 2023
# print(my_dict)

